# ContinuousrailBeginningTerminationTypeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousrailBeginningTerminationTypeParam Property
ParameterTypeId Class See Also
---
"Beginning/Bottom Termination"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousrailBeginningTerminationTypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousrailBeginningTerminationTypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousrailBeginningTerminationTypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace